class lists:
    def __init__(self):
        pass


def get_list_of_cities():
    return ['כפר יונה', 'מודיעין', 'קרית גת', 'סירקין', 'טיר', 'בת ים', 'קריית ארבע', 'גבעת שמואל', 'נצרת', 'הר עציון', 'חיפה', 'יקנעם עילית', 'קריית ים', "סח'נין", 'טמרה', 'תל אביב', 'גבעתיים', 'ערד', 'ראש פינה', 'באר שבע', 'בני ברק', 'נס ציונה', 'הוד השרון', 'מעלות-תרשיחא', 'אור יהודה', 'דימונה', 'קריית שמונה', 'טבריה', 'רהט', 'יפו', 'נשר', 'נשר עיר', 'קריית ביאליק', 'בית שאן', 'טייבה', 'מודיעין עילית', 'נתניה', 'רמת גן', 'מודיעין-מכבים-רעות', 'חולון', 'יקנעם', 'עראבה', 'קריית טבעון', 'עפולה', 'נצרת עילית', 'קלנסווה', 'באקה אל-גרביי', 'כפר סבא', 'ביתר עילית', 'לוד', 'רמת השרון', 'מעלה אדומים', 'יבנה', 'שדרות', 'אשקלון', 'הרצליה', 'מטולה', 'כפר קאסם', 'אשדוד', 'עכו', 'כרמיאל', 'אלעד', 'רעננה', 'טירת כרמל', 'פתח תקווה', 'אום אל-פחם', 'חדרה', 'קריית אונו', 'ראשון לציון', 'נתיבות', 'צפת', 'קריית גת', 'אריאל', 'ירושלים', 'קריית אתא', 'נהריה', 'ראש העין', 'איל', 'אילת', 'תל אביב-יפו', 'בית שמש', 'קריית מלאכי', 'גבעת שמוא', 'אופקים', 'אור עקיבא', 'יהוד-מונוסון', 'רמלה', 'מודיעי', 'מגדל העמק', 'שפרעם', 'זכרון יעקב', 'נוף הגליל', 'קריית מוצקין', 'רחובות']


def get_list_of_places(file_name='list_of_places'):
    file = open(file_name)
    r = file.readline()
    s = {r}
    last_r = None
    while r != '':
        # print(r[:-1])
        s.add(r[:-1])
        last_r = r
        r = file.readline()

    s.remove(last_r[:-1])
    s.add(last_r)

    # print(len(s))
    # print(s)

    file.close()
    return list(s)

